
# label: -1,表示数据集之中的背景;
# 1: 表示行人
# 2: 表示机动车
# 3: 非机动车
# 4: 头肩
# 5: 人脸
label_map_dict = {
'mask': -1,
    'maks': -1,
    'maask': -1,
    'background': -1,
    'MASK': -1,
    'MASKAA': -1,
    ############################################
    # "行人-预估": 1,
    "行人": 0,
    "Person": 0,
    "person": 0,
    ############################################
    "轿车": 1,
    "汽车": 1,
    "小轿车": 1,
    "跑车": 1,
    "SUV": 1,
    "MPV": 1,
    "机动车": 1,   # 需要校验实际图像的类型
    "Car": 1,
    ############################################
    "皮卡": 1,
    "微型卡车": 1,
    "轻型卡车": 1,
    "中型卡车": 1,
    "重型卡车": 1,
    "Truck": 1,
    "市政清洁车": 1,
    "特种车": 1,   # 需要校验实际图像的类型, 来自南宁数据集; 校验完成, 可以初步归结到卡车
    "挖掘机": 1,
    "推土机": 1,
    "叉车": 1,
    ############################################
    "面包车": 1,
    "小客": 1,
    "中客": 1,
    "大客": 1,
    "Bus": 1,
    ###########################################
    "非机动车": 2,   # 需要校验实际图像的类型
    "自行车": 2,
    "Bicycle": 2,
    "MotorBike": 2,
    "ElectroMboile": 2,
    "电瓶车": 2,
    "摩托车": 2,
    ###########################################
    "三轮车": 2,
    "老年代步车": 2,
    "Tricycle": 2,
    ###########################################
    "头肩": 3,
    "车内头肩": 3,
    ###########################################
    # "人脸": 7,
    # "车内人脸": 7,
    ############################################
    # "骑手-预估":1,
    "骑手": 1,
    "Rider": 1,
}



def label_map(org_xml_lable: str) -> int:
    if org_xml_lable is None:
        return -1

    org_xml_lable = org_xml_lable.strip()

    if org_xml_lable[-2:] == "预估":
        return -2

    if org_xml_lable in label_map_dict:
        return label_map_dict[org_xml_lable]

    for key in label_map_dict:
        if key in org_xml_lable:  # 行人 == 行人; 行人 in 行人-评估
            return label_map_dict[key]

    print("不使用Label: ", org_xml_lable)
    return -3  # 不存在
    

        
    

if __name__ == "__main__":
    lables = "Bicycle-预估"
    print(label_map(lables))